<script setup>
import HeaderBannerMobile from "@/components/HeaderComponents/HeaderBannerMobile";
import SearchHeader from "@/components/HeaderComponents/SearchHeader";
import {useMainStore} from "@/store/MainStore";
import {computed} from "vue";

const mainStore = useMainStore();

const width = computed(() => mainStore.display_width);
</script>

<template>
  <section class="question">
    <div class="wrapper">
      <header-banner-mobile v-if="width <= 768" />
      <search-header v-if="width > 1024"/>
      <div class="content">
        <h2 class="textMontserrat textMontserrat_medium">
          Политика обработки персональных данных
        </h2>
        <p class="textMontserrat textMontserrat_medium">
          Настоящая политика обработки персональных данных составлена в соответствии с
          требованиями Федерального закона от 27.07.2006г №152- о защите персональных данных.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            1.Общие положения
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          ООО «Возможно все! продакшен» (далее-Компания или Оператор) обрабатывает и защищает
          персональные данные зарегистрированных и незарегистрированных пользователей сайта
          Production City, принадлежащего Оператору, а также тех, кто связывается с компанией по
          номерам телефона, либо по электронной почте указанным на сайте.
          Отношения, связанные с обработкой компанией персональных данных, регулируются
          законодательством Российской Федерации.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Предоставляя нам персональные данные, вы соглашаетесь на их обработку в
          соответствии с этой политикой.
          Использование сайта означает ваше согласие с условиями настоящей Политики
          конфиденциальности. В случае несогласия с этими условиями просим воздержаться от
          использования ресурса.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            2.Определения
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          -Персональные данные – любая информация, относящаяся к прямо или косвенно
          определённому, или определяемому физическому лицу (субъекту персональных данных).
          -Обработка персональных данных- любое действие (операция) или совокупность действий
          (операций) с персональными данными.<br>
          -Пользователь - физическое лицо либо организация, использующие Платформу (сайт) –
          Production City.<br>
          -Платформа (Площадка) – сайт, ресурс в сети Интернет по адресу: <a href="https://productioncity.pro">https://productioncity.pro</a>,
          Компания является оператором по отношению к персональным данным, которые Вы
          указываете, на Ваше усмотрение, в связи с использованием вами сайта Production City
          (включая сайт и мобильные приложения).
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            3. Цели обработки персональных данных
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Обработка персональных данных осуществляется с целью:<br>
          -регистрация и авторизация на Площадке пользователей;<br>
          -предоставление доступа к функционалу Площадки;<br>
          -размещение, просмотр и подбор товаров и услуг на площадке;<br>
          -взаимодействие с другими пользователями;<br>
          -заключение и исполнения сделок между Пользователями<br>
          -связь с Пользователем (информирование, техническая поддержка;<br>
          - повышение качества сервиса и безопасности;<br>
          - доставка товаров / оказание услуг;<br>
          -Соблюдение требований законодательства Российской Федерации.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            4. Какие данные мы обрабатываем
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Вы предоставляете нам персональные данные, когда Вы регистрируетесь на сайте Production
          City, либо используете Сайт и услуги площадки, подписываетесь на различные рассылки,
          принимаете участие в мероприятиях, проводимых в рамках площадки, либо посредством
          площадки, оплачиваете услуги компании, когда обращаетесь к Оператору путем звонков либо
          письменно через контакты указанные на Сайте.<br>

          - Фамилия Имя Отчество;<br>
          -дата рождения;<br>
          -номер телефона;<br>
          -адрес электронной почты;<br>
          - почтовый адрес;<br>
          -данные профиля на платформе(логин, фотографии, описание);<br>
          -информация, указанная при заполнении анкеты либо размещении предложений
          Пользователя на Площадке (сайте), текстовые, графические, фото и др. материалы и данные,
          которые размещаются Пользователем на Площадке;<br>
          -IP-адрес, данные cookie;<br>
          -информация о действиях Пользователя на Платформе;<br>
          -сообщения, отправляемые через формы обратной связи либо внутренние чаты.<br>
          Ваше устройство автоматически передает технические данные: информацию, сохраненную в
          файлах куки (cookies), информацию о браузере, дате и времени доступа к Сайту, адресах
          запрашиваемых страниц, действиях на сайте или в приложении, технических
          характеристиках устройства, IP-адресе и т.п.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            5. Правовые основания для обработки персональных данных
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Обработка персональных данных осуществляется на основании:<br>
          - согласия Пользователя;<br>
          - необходимости выполнения условий договора, стороной которого является субъект
          персональных данных;<br>
          - соблюдение требований законодательства Российской Федерации;<br>
          - защиты интересов Пользователя и третьих лиц
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            6. Порядок сбора, хранения и уничтожения персональных данных
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          - сбор персональных данных осуществляется с согласия Пользователя при регистрации и/или
          заполнении форм либо при размещении предложений на сайте.<br>
          - хранение персональных данных осуществляется в защищенных местах и на защищенных
          серверах.<br>
          - доступ к персональным данным имеют только лица, которым это необходимо для
          выполнения своих должностных обязанностей.<br>
          -персональные данные уничтожаются при удалении учетной записи и личного кабинета
          Пользователем, либо при обращении в службу поддержки.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            7. Передача персональных данных
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Персональные данные Пользователей могут передаваться:<br>
          -Государственным органам в порядке, установленном законодательством Российской
          Федерации;<br>
          -контрагентам и партнерам сайта, оказывающим услуги, которые участвуют в
          предоставлении вам тех или иных сервисов и услуг, например службам доставки,
          операторам платежных систем (при наличии), CRM- системы и аналитические сервисы,
          хостинг-провайдеры и облачные хранилища;<br>
          - другим Пользователям сайта в рамках ознакомления и заключения ими сделок ( например,
          содержание опубликованного предложения (объявления) и контактная информация для
          связи)
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            8. Размещение данных на Production City
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          При размещении Вами объявления на сайте Production City, либо любой другой информации
          включая персональные данные, которые публикуются в общей сети интернет и могут быть
          доступны любому пользователю в сети интернет.
          Регистрируясь и пользуясь сайтом Production City, Вы подтверждаете свое согласие с
          условиями настоящей Политикой конфиденциальности.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            9. Изменения в политике конфиденциальности
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Администрация сайта имеет право вносить изменения в Политику в рамках
          законодательства Российской Федерации.
          Новая редакция Политики вступает в силу с момента ее размещения на сайте.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            10. Наши реквизиты:
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          ООО «Возможно все! продакшен» ОГРН 1227700251569
          129128, РОССИЯ, г МОСКВА, пр-кт МИРА, ДОМ 188, офис ПОМЕЩ. I КОМ. 1 ОФИС 18
          Электронная почта для связи( обращений, пожеланий и предложений):
          <a href="mailto:productioncity@rambler.ru">productioncity@rambler.ru</a>
        </p>
      </div>
    </div>
  </section>
</template>

<style scoped lang="scss">
.content {
  max-width: 60%;
  margin: 0 auto;
  display: flex;
  flex-direction: column;
  gap: 20px;

  @media (max-width: em(768, 16)) {
    max-width: 100%;
  }

  h2 {
    font-size: rem(36);
    margin-top: rem(40);
    margin-bottom: rem(20);
  }

  p {
    margin-bottom: rem(20);
    font-size: rem(18);
  }
}
</style>