<script setup>
import HeaderBannerMobile from "@/components/HeaderComponents/HeaderBannerMobile";
import SearchHeader from "@/components/HeaderComponents/SearchHeader";
import {useMainStore} from "@/store/MainStore";
import {computed} from "vue";

const mainStore = useMainStore();

const width = computed(() => mainStore.display_width);
</script>

<template>
  <section class="question">
    <div class="wrapper">
      <header-banner-mobile v-if="width <= 768" />
      <search-header v-if="width > 1024"/>
      <div class="content">
        <h2 class="textMontserrat textMontserrat_medium">
          Пользовательское соглашение
        </h2>
        <p class="textMontserrat textMontserrat_medium">
          ООО «Возможно все! продакшен»<br>
          Сайт: <a href="https://productioncity.pro">www.productioncity.pro</a>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            1.Общие положения
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          1.1. Настоящее пользовательское соглашение (далее-Соглашение) является
          публичной офертой ООО «Возможно все! продакшен»<br>
          ОГРН: 1227700251569<br>
          электронная почта: productioncity@rambler.ru<br>
          адрес: 129128, Россия, г.Москва,
          проспект Мира, дом 188, пом.1, ком.1, офис 18 (далее – Администрация), и
          определяет условия использования интернет платформы www.productioncity.pro
          (далее-Сайт).<br>
          1.2. Использование Сайта означает, что Вы принимаете условия настоящего
          Соглашения без изменений.<br>
          1.3. В случае несогласия с положениями Соглашения Вам следует прекратить любое
          использование Сайта.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            2.Определения
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          2.1. Пользователь - физическое или юридическое лицо, имеющее доступ к Сайту и
          использующее его в личных или коммерческих целях.<br>
          2.2. Продавец - Пользователь, размещающий предложения товаров или услуг на
          Сайте.<br>
          2.3. Покупатель – Пользователь, желающий приобрести товары или услуги,
          размещенные Продавцами.<br>
          2.4. Контент – информация, тексты, изображения, видео, фото и аудио записи,
          контакты, и другие материалы, размещаемые Пользователями на Сайте.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            3. Предмет соглашения
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          3.1. Администрация предоставляет Пользователю право на использование
          функционала Сайта на условиях, предусмотренных настоящим Соглашением.<br>
          3.2. Пользователь обязуется соблюдать условия Соглашения, действующее
          законодательство Российской Федерации и уважать права третьих лиц.<br>
          3.3. Пользователь, принимая настоящее Соглашение, выражает свое полное
          согласие на обработку персональных данных, так же кино, фото, видео, аудио,
          графической, контактной и любой другой информации, которые Пользователь
          размещает на Сайте в общем доступе в сети интернет.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            4. Регистрация и учетная запись
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          4.1. При регистрации на Сайте Пользователь предоставляет достоверную
          информацию о себе.<br>
          4.2. Пользователь несет полную ответственность за сохранность своих учетных
          данных и пароля.<br>
          4.3. Администрация имеет право приостановить или удалить аккаунт
          Пользователя в случае нарушения условий Соглашения.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            5. Права и обязанности сторон
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          5.1. Обязанности Администрации:<br>
          - Обеспечивать функционирование Сайта;<br>
          - Обрабатывать обращение Пользователей;<br>
          - Соблюдать условия конфиденциальности (см. Политику конфиденциальности).<br>
          5.2. Обязанности Пользователя:<br>
          - Не нарушать работу Сайта;<br>
          - Не использовать автоматизированные скрипты для сбора данных;<br>
          - Не распространять вирусы, спам, запрещенный контент;<br>
          - Не нарушать авторские права третьих лиц.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            6. Контент и интеллектуальная собственность
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          6.1. Все права на Сайт, дизайн, логотипы, тексты, изображения и программное
          обеспечение принадлежат Администрации.<br>
          6.2. Пользователи сохраняют авторские права на свой контент, но предоставляют
          Администрации неисключительное право на его использование (в том числе
          копирование, воспроизведение, модификацию) в целях функционирования Сайта.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            7. Ответственность
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          7.1. Администрация не несет ответственности за действия Пользователей, включая
          на данные, включая качество предлагаемых товаров и услуг.<br>
          7.2. Пользователь самостоятельно несет ответственность за соответствие
          размещаемого контента законодательству РФ.<br>
          7.3. Администрация не гарантирует бесперебойную работу Сайта и не несет
          ответственности за убытки связанные с его временным отсутствием и
          неработоспособностью.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            8. Изменение условий
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          Администрация вправе вносить изменения в данное Соглашение. Новая редакция
          публикуется на Сайте и вступает в силу с момента публикации. Продолжение
          использования Сайта означает принятие новых условий.
        </p>
        <p class="textMontserrat textMontserrat_medium">
          <b>
            9. Прочие условия
          </b>
        </p>
        <p class="textMontserrat textMontserrat_medium">
          9.1. Все споры разрешаются в соответствии с законодательством Российской
          Федерации.<br>
          9.2. Настоящее Соглашение составлено на русском языке и может быть
          предоставлено на других языках. В случае расхождений приоритет имеет русская
          версия.
        </p>
      </div>
    </div>
  </section>
</template>

<style scoped lang="scss">
.content {
  max-width: 60%;
  margin: 0 auto;
  display: flex;
  flex-direction: column;
  gap: 20px;

  @media (max-width: em(768, 16)) {
    max-width: 100%;
  }

  h2 {
    font-size: rem(36);
    margin-top: rem(40);
    margin-bottom: rem(20);
  }

  p {
    margin-bottom: rem(20);
    font-size: rem(18);
  }
}
</style>